ReactiveProgramming/PerformingTest/bank/reports/sync-100ms-latency.out
____________________________________________________________
TEST with 500 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      500
Time taken for tests:   16.119 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    620.40 [#/sec] (mean)
Time per request:       805.926 [ms] (mean)
Time per request:       1.612 [ms] (mean, across all concurrent requests)
Transfer rate:          154.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.9      1      80
Processing:   406  781 119.7    771    1330
Waiting:      406  779 119.4    768    1324
Total:        439  784 119.0    772    1343

Percentage of the requests served within a certain time (ms)
  50%    772
  66%    833
  75%    864
  80%    884
  90%    926
  95%    966
  98%   1034
  99%   1156
 100%   1343 (longest request)
____________________________________________________________
TEST with 1000 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      1000
Time taken for tests:   15.924 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    627.99 [#/sec] (mean)
Time per request:       1592.392 [ms] (mean)
Time per request:       1.592 [ms] (mean, across all concurrent requests)
Transfer rate:          156.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   7.9      1      84
Processing:   236 1509 208.5   1523    1999
Waiting:      236 1506 208.1   1521    1999
Total:        281 1513 203.7   1526    2013

Percentage of the requests served within a certain time (ms)
  50%   1526
  66%   1582
  75%   1622
  80%   1644
  90%   1714
  95%   1766
  98%   1804
  99%   1891
 100%   2013 (longest request)